In [2]:
import pandas as pd
athletes = pd.read_csv('./pandas/athletes_clean.csv')
athletes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11538 entries, 0 to 11537
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             11538 non-null  int64
 1   name           11538 non-null  object
 2   nationality    11538 non-null  object
 3   sex            11538 non-null  object
 4   date_of_birth  11538 non-null  object
 5   height         11208 non-null  float64
 6   weight         10879 non-null  float64
 7   sport          11538 non-null  object
 8   gold           11538 non-null  int64
 9   silver         11538 non-null  int64
 10  bronze         11538 non-null  int64
 11  info           131 non-null    object
dtypes: float64(2), int64(4), object(6)
memory usage: 1.1+ MB

In [3]:
g = athletes.groupby('nationality')

In [4]:
g.sum() #the index becomes the group by argument

                      id  height  weight  gold  silver  bronze
nationality
AFG            544720346    5.21   222.0     0       0       0
ALB           3224936557   10.57   404.0     0       0       0
ALG          34523048655  119.43  4219.0     0       2       0
AND           3059131853    8.56   320.0     0       0       0
ANG          10511499494   45.82  1907.0     0       0       0
...                  ...     ...     ...   ...     ...     ...
VIE          10541691287   38.27  1360.0     1       1       0
VIN           2891918513    3.51   120.0     0       0       0
YEM           2482979326    5.09   194.0     0       0       0
ZAM           3000084717   10.60   405.0     0       0       0
ZIM          17589703247   58.66  2193.0     0       0       0

[207 rows x 6 columns]

In [5]:
g.sum()[['gold', 'silver', 'bronze']]

             gold  silver  bronze
nationality
AFG             0       0       0
ALB             0       0       0
ALG             0       2       0
AND             0       0       0
ANG             0       0       0
...           ...     ...     ...
VIE             1       1       0
VIN             0       0       0
YEM             0       0       0
ZAM             0       0       0
ZIM             0       0       0

[207 rows x 3 columns]

In [6]:
g= athletes.groupby('nationality')[['gold', 'silver', 'bronze']]
g.sum()

             gold  silver  bronze
nationality
AFG             0       0       0
ALB             0       0       0
ALG             0       2       0
AND             0       0       0
ANG             0       0       0
...           ...     ...     ...
VIE             1       1       0
VIN             0       0       0
YEM             0       0       0
ZAM             0       0       0
ZIM             0       0       0

[207 rows x 3 columns]

In [7]:
g= athletes.groupby(['sport', 'sex'])['weight', 'height']

<ipython-input-7-824c01e49d50>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  g= athletes.groupby(['sport', 'sex'])['weight', 'height']

In [11]:
g.mean()

                              weight    height
sport             sex
aquatics          female   62.284483  1.715712
                  male     82.219061  1.860342
archery           female   64.301587  1.676190
                  male     80.079365  1.795714
athletics         female   60.152542  1.690500
                  male     74.777680  1.809234
badminton         female   61.209877  1.686000
                  male     76.156627  1.805059
basketball        female   75.377622  1.833819
                  male    100.297872  2.003611
boxing            female         NaN  1.682222
                  male           NaN  1.757615
canoe             female   66.457944  1.700648
                  male     82.150000  1.820455
cycling           female   60.207254  1.673128
                  male     72.576052  1.793074
equestrian        female   58.634146  1.682530
                  male     72.954887  1.790000
fencing           female   62.733871  1.712581
                  male     78.785124  1.833802
football          female   61.061069  1.682710
                  male     74.451713  1.793746
golf              female   63.200000  1.691404
                  male     79.000000  1.793500
gymnastics        female   49.555024  1.616524
                  male     63.254545  1.677105
handball          female   70.789157  1.759722
                  male     95.431694  1.913169
hockey            female   60.425926  1.667870
                  male     77.375000  1.800093
judo              female   65.392157  1.665132
                  male     84.616740  1.781783
modern pentathlon female   58.000000  1.699444
                  male     73.916667  1.825278
rowing            female   69.776190  1.773286
                  male     86.504615  1.898708
rugby sevens      female   66.595890  1.678552
                  male     90.450331  1.829145
sailing           female   63.194969  1.692767
                  male     77.122066  1.812770
shooting          female   62.675676  1.648400
                  male     81.068966  1.780343
table tennis      female   57.530120  1.653659
                  male     72.558140  1.786860
taekwondo         female   61.258065  1.730159
                  male     74.809524  1.863750
tennis            female   64.670455  1.734205
                  male     80.417476  1.860388
triathlon         female   54.563636  1.676545
                  male     66.814815  1.788704
volleyball        female   70.684211  1.828691
                  male     89.421875  1.964010
weightlifting     female   68.788462  1.603558
                  male     87.538961  1.709221
wrestling         female   61.805310  1.651239
                  male     85.372881  1.757215

In [15]:
athletes.groupby(['sport', 'sex'])['gold'].sum().tail(30)

sport              sex
handball           female    15
                   male      14
hockey             female    16
                   male      18
judo               female     7
                   male       7
modern pentathlon  female     1
                   male       1
rowing             female    20
                   male      28
rugby sevens       female    12
                   male      13
sailing            female     7
                   male       8
shooting           female     6
                   male       9
table tennis       female     4
                   male       4
taekwondo          female     4
                   male       4
tennis             female     4
                   male       4
triathlon          female     1
                   male       1
volleyball         female    14
                   male      14
weightlifting      female     7
                   male       8
wrestling          female     6
                   male      12
Name: gold, dtype: int64

In [16]:
m = pd.read_csv('./pandas/monthly_data.csv')
m

,YYYY,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,YEAR
0,2008,10140,10239,10050,10111,10159,10159,10141,10117,10178,10148,10125,10182,10146
1,2009,10137,10140,10140,10141,10188,10168,10128,10165,10208,10166,10041,10068,10141
2,2010,10151,10034,10168,10194,10158,10166,10158,10129,10147,10135,10057,10133,10136
3,2011,10182,10161,10227,10192,10182,10154,10123,10130,10149,10182,10194,10099,10165
4,2012,10194,10286,10271,10053,10159,10127,10139,10155,10149,10109,10108,10085,10153
5,2013,10142,10169,10099,10155,10113,10180,10201,10176,10151,10129,10155,10170,10153
6,2014,10055,10031,10164,10148,10154,10184,10143,10117,10189,10142,10103,10172,10134
7,2015,10135,10164,10198,10214,10152,10195,10142,10152,10171,10186,10150,10217,10173
8,2016,10100,10099,10144,10122,10140,10137,10168,10183,10177,10214,10144,10283,10159
9,2017,10228,10151,10154,10211,10170,10134,10141,10162,10135,10176,10141,10120,10160

In [17]:
m.set_index('YYYY', inplace=True)
m

,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,YEAR
YYYY,,,,,,,,,,,,,
2008,10140,10239,10050,10111,10159,10159,10141,10117,10178,10148,10125,10182,10146
2009,10137,10140,10140,10141,10188,10168,10128,10165,10208,10166,10041,10068,10141
2010,10151,10034,10168,10194,10158,10166,10158,10129,10147,10135,10057,10133,10136
2011,10182,10161,10227,10192,10182,10154,10123,10130,10149,10182,10194,10099,10165
2012,10194,10286,10271,10053,10159,10127,10139,10155,10149,10109,10108,10085,10153
2013,10142,10169,10099,10155,10113,10180,10201,10176,10151,10129,10155,10170,10153
2014,10055,10031,10164,10148,10154,10184,10143,10117,10189,10142,10103,10172,10134
2015,10135,10164,10198,10214,10152,10195,10142,10152,10171,10186,10150,10217,10173
2016,10100,10099,10144,10122,10140,10137,10168,10183,10177,10214,10144,10283,10159
2017,10228,10151,10154,10211,10170,10134,10141,10162,10135,10176,10141,10120,10160

In [18]:
m.stack()

YYYY
2008  JAN     10140
      FEB     10239
      MAR     10050
      APR     10111
      MAY     10159
              ...
2017  SEP     10135
      OCT     10176
      NOV     10141
      DEC     10120
      YEAR    10160
Length: 130, dtype: int64

In [20]:
m.stack().sum()

1319751

In [21]:
w = athletes.groupby(['sport', 'sex'])['weight'].mean()
w

sport              sex
aquatics           female     62.284483
                   male       82.219061
archery            female     64.301587
                   male       80.079365
athletics          female     60.152542
                   male       74.777680
badminton          female     61.209877
                   male       76.156627
basketball         female     75.377622
                   male      100.297872
boxing             female           NaN
                   male             NaN
canoe              female     66.457944
                   male       82.150000
cycling            female     60.207254
                   male       72.576052
equestrian         female     58.634146
                   male       72.954887
fencing            female     62.733871
                   male       78.785124
football           female     61.061069
                   male       74.451713
golf               female     63.200000
                   male       79.000000
gymnastics         female     49.555024
                   male       63.254545
handball           female     70.789157
                   male       95.431694
hockey             female     60.425926
                   male       77.375000
judo               female     65.392157
                   male       84.616740
modern pentathlon  female     58.000000
                   male       73.916667
rowing             female     69.776190
                   male       86.504615
rugby sevens       female     66.595890
                   male       90.450331
sailing            female     63.194969
                   male       77.122066
shooting           female     62.675676
                   male       81.068966
table tennis       female     57.530120
                   male       72.558140
taekwondo          female     61.258065
                   male       74.809524
tennis             female     64.670455
                   male       80.417476
triathlon          female     54.563636
                   male       66.814815
volleyball         female     70.684211
                   male       89.421875
weightlifting      female     68.788462
                   male       87.538961
wrestling          female     61.805310
                   male       85.372881
Name: weight, dtype: float64

In [22]:
w.unstack() #by default it will take the inner index

sex                   female        male
sport
aquatics           62.284483   82.219061
archery            64.301587   80.079365
athletics          60.152542   74.777680
badminton          61.209877   76.156627
basketball         75.377622  100.297872
boxing                   NaN         NaN
canoe              66.457944   82.150000
cycling            60.207254   72.576052
equestrian         58.634146   72.954887
fencing            62.733871   78.785124
football           61.061069   74.451713
golf               63.200000   79.000000
gymnastics         49.555024   63.254545
handball           70.789157   95.431694
hockey             60.425926   77.375000
judo               65.392157   84.616740
modern pentathlon  58.000000   73.916667
rowing             69.776190   86.504615
rugby sevens       66.595890   90.450331
sailing            63.194969   77.122066
shooting           62.675676   81.068966
table tennis       57.530120   72.558140
taekwondo          61.258065   74.809524
tennis             64.670455   80.417476
triathlon          54.563636   66.814815
volleyball         70.684211   89.421875
weightlifting      68.788462   87.538961
wrestling          61.805310   85.372881

In [26]:
p = pd.DataFrame({'id':[823905, 823905, 
                    235897, 235897, 235897, 
                    983422, 983422],
                'item': ['prize', 'unit', 'prize', 'unit', 'stock', 'prize', 'stock'],
                'value':[3.49, 'kg', 12.89, 'l', 50, 0.49, 4]})
p

       id   item  value
0  823905  prize   3.49
1  823905   unit     kg
2  235897  prize  12.89
3  235897   unit      l
4  235897  stock     50
5  983422  prize   0.49
6  983422  stock      4

In [28]:
p.pivot('id', 'item', 'value') #first argument is the row indices, second argument is where to get the column names, third argument is where to get the values

item    prize stock unit
id
235897  12.89    50    l
823905   3.49   NaN   kg
983422   0.49     4  NaN

In [30]:
grades = pd.DataFrame([[6,4,5], [7,8,7], [6,7,9], [6,5,5], [5,2,7]],
                        index = ['Mary', 'John','Ann', 'Pete', 'Laura'],
                        columns = ['test_1', 'test_2', 'test_3'])
grades

       test_1  test_2  test_3
Mary        6       4       5
John        7       8       7
Ann         6       7       9
Pete        6       5       5
Laura       5       2       7

In [31]:
grades.melt() #we lost the information about the students because it was in the index column

   variable  value
0    test_1      6
1    test_1      7
2    test_1      6
3    test_1      6
4    test_1      5
5    test_2      4
6    test_2      8
7    test_2      7
8    test_2      5
9    test_2      2
10   test_3      5
11   test_3      7
12   test_3      9
13   test_3      5
14   test_3      7

In [36]:
grades.reset_index(inplace=True)

In [38]:
grades.melt(id_vars=['index'])

    index variable  value
0    Mary   test_1      6
1    John   test_1      7
2     Ann   test_1      6
3    Pete   test_1      6
4   Laura   test_1      5
5    Mary   test_2      4
6    John   test_2      8
7     Ann   test_2      7
8    Pete   test_2      5
9   Laura   test_2      2
10   Mary   test_3      5
11   John   test_3      7
12    Ann   test_3      9
13   Pete   test_3      5
14  Laura   test_3      7

In [ ]:
grades['test_4'] = pd.Series({'John': 5, 'Ann': 8, 'Pete', 'Mary':7, 'Laura':10})